# GetReinforcementRoundingManager Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
RebarContainer..::..GetReinforcementRoundingManager Method
RebarContainer Class See Also
---
Returns an object for managing reinforcement rounding override settings.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2016
# Syntax
C#
---
```text
public RebarRoundingManager GetReinforcementRoundingManager()
```

Visual Basic
---
```text
Public Function GetReinforcementRoundingManager As RebarRoundingManager
```

Visual C++
---
```text
public:
RebarRoundingManager^ GetReinforcementRoundingManager()
```

# ### Return Value
The rounding manager.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Structural. |

# See Also
RebarContainer Class
Autodesk.Revit.DB.Structure Namespace